app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    #@questions = Question.all
    @questions = Question.paginate(page: params[:page], per_page: 5)

INSERT INTO "questions" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Jun 2017 10:28:04 UTC +00:00], ["description", "sdfaf"], ["title", "ABC"], ["updated_at", Mon, 12 Jun 2017 10:28:04 UTC +00:00]]
---
  def create
    @question = current_user.questions.build(question_params)

    respond_to do |format|
      if @question.save